inventory_service_perf/wrk_report/inventory_python310_write_700.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 7.205ms, rate sampling interval: 25ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.97ms    5.97ms 250.50ms   88.56%
    Req/Sec   714.58    182.77     1.38k    74.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.82ms
 75.000%    9.26ms
 90.000%   14.74ms
 99.000%   29.58ms
 99.900%   43.78ms
 99.990%  234.24ms
 99.999%  249.21ms
100.000%  250.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.741     0.000000            1         1.00
       4.139     0.100000         7705         1.11
       4.567     0.200000        15343         1.25
       4.943     0.300000        23032         1.43
       5.327     0.400000        30670         1.67
       5.819     0.500000        38340         2.00
       6.147     0.550000        42203         2.22
       6.591     0.600000        46003         2.50
       7.235     0.650000        49830         2.86
       8.103     0.700000        53659         3.33
       9.263     0.750000        57509         4.00
      10.007     0.775000        59413         4.44
      10.767     0.800000        61331         5.00
      11.599     0.825000        63250         5.71
      12.423     0.850000        65159         6.67
      13.423     0.875000        67073         8.00
      14.047     0.887500        68033         8.89
      14.743     0.900000        68993        10.00
      15.567     0.912500        69957        11.43
      16.415     0.925000        70910        13.33
      17.311     0.937500        71864        16.00
      17.759     0.943750        72350        17.78
      18.207     0.950000        72821        20.00
      18.703     0.956250        73303        22.86
      19.311     0.962500        73779        26.67
      20.271     0.968750        74258        32.00
      21.039     0.971875        74497        35.56
      21.887     0.975000        74735        40.00
      23.103     0.978125        74975        45.71
      24.511     0.981250        75214        53.33
      25.903     0.984375        75455        64.00
      26.655     0.985938        75574        71.11
      27.759     0.987500        75692        80.00
      28.959     0.989062        75816        91.43
      30.175     0.990625        75934       106.67
      31.519     0.992188        76052       128.00
      32.303     0.992969        76112       142.22
      33.087     0.993750        76172       160.00
      33.983     0.994531        76231       182.86
      35.295     0.995313        76294       213.33
      36.447     0.996094        76352       256.00
      37.151     0.996484        76382       284.44
      38.079     0.996875        76412       320.00
      38.623     0.997266        76443       365.71
      39.391     0.997656        76471       426.67
      40.415     0.998047        76501       512.00
      40.895     0.998242        76516       568.89
      41.695     0.998437        76531       640.00
      42.239     0.998633        76546       731.43
      43.039     0.998828        76561       853.33
      44.607     0.999023        76576      1024.00
      45.151     0.999121        76584      1137.78
      45.887     0.999219        76591      1280.00
      47.327     0.999316        76598      1462.86
      50.687     0.999414        76606      1706.67
      51.999     0.999512        76613      2048.00
      53.119     0.999561        76617      2275.56
      56.031     0.999609        76621      2560.00
      58.751     0.999658        76624      2925.71
      63.135     0.999707        76628      3413.33
      71.871     0.999756        76632      4096.00
     100.479     0.999780        76634      4551.11
     106.943     0.999805        76636      5120.00
     107.967     0.999829        76637      5851.43
     111.487     0.999854        76639      6826.67
     114.239     0.999878        76641      8192.00
     234.239     0.999890        76642      9102.22
     237.183     0.999902        76643     10240.00
     239.231     0.999915        76644     11702.86
     243.839     0.999927        76645     13653.33
     245.375     0.999939        76646     16384.00
     245.375     0.999945        76646     18204.44
     245.631     0.999951        76647     20480.00
     245.631     0.999957        76647     23405.71
     248.191     0.999963        76648     27306.67
     248.191     0.999969        76648     32768.00
     248.191     0.999973        76648     36408.89
     249.215     0.999976        76649     40960.00
     249.215     0.999979        76649     46811.43
     249.215     0.999982        76649     54613.33
     249.215     0.999985        76649     65536.00
     249.215     0.999986        76649     72817.78
     250.623     0.999988        76650     81920.00
     250.623     1.000000        76650          inf
#[Mean    =        7.969, StdDeviation   =        5.971]
#[Max     =      250.496, Total count    =        76650]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  83871 requests in 2.00m, 14.88MB read
Requests/sec:    698.92
Transfer/sec:    126.95KB