inventory_service_perf/wrk_report/inventory_python310_write_800.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 14.582ms, rate sampling interval: 54ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.66ms   12.86ms 329.47ms   90.50%
    Req/Sec   807.23    147.52     1.19k    71.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.09ms
 75.000%   18.13ms
 90.000%   26.54ms
 99.000%   63.97ms
 99.900%  124.67ms
 99.990%  264.19ms
 99.999%  305.41ms
100.000%  329.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.435     0.000000            1         1.00
       6.051     0.100000         8772         1.11
       7.603     0.200000        17550         1.25
       8.215     0.300000        26315         1.43
       8.759     0.400000        35147         1.67
      10.087     0.500000        43813         2.00
      11.383     0.550000        48182         2.22
      13.391     0.600000        52563         2.50
      14.719     0.650000        56948         2.86
      16.111     0.700000        61335         3.33
      18.127     0.750000        65737         4.00
      18.975     0.775000        67936         4.44
      19.631     0.800000        70109         5.00
      20.335     0.825000        72287         5.71
      21.327     0.850000        74480         6.67
      23.967     0.875000        76655         8.00
      25.055     0.887500        77752         8.89
      26.543     0.900000        78846        10.00
      28.783     0.912500        79941        11.43
      30.351     0.925000        81036        13.33
      32.495     0.937500        82130        16.00
      33.887     0.943750        82677        17.78
      34.975     0.950000        83229        20.00
      36.159     0.956250        83775        22.86
      38.303     0.962500        84321        26.67
      40.383     0.968750        84874        32.00
      41.663     0.971875        85140        35.56
      43.871     0.975000        85412        40.00
      46.015     0.978125        85687        45.71
      49.951     0.981250        85961        53.33
      54.207     0.984375        86234        64.00
      56.223     0.985938        86371        71.11
      59.391     0.987500        86508        80.00
      62.111     0.989062        86644        91.43
      65.119     0.990625        86782       106.67
      69.695     0.992188        86920       128.00
      72.703     0.992969        86989       142.22
      75.327     0.993750        87055       160.00
      78.399     0.994531        87123       182.86
      82.111     0.995313        87192       213.33
      98.303     0.996094        87260       256.00
     104.191     0.996484        87295       284.44
     107.199     0.996875        87329       320.00
     110.079     0.997266        87364       365.71
     114.239     0.997656        87397       426.67
     116.671     0.998047        87431       512.00
     118.975     0.998242        87449       568.89
     119.935     0.998437        87467       640.00
     121.407     0.998633        87484       731.43
     123.455     0.998828        87500       853.33
     124.799     0.999023        87518      1024.00
     126.335     0.999121        87526      1137.78
     130.367     0.999219        87534      1280.00
     139.903     0.999316        87543      1462.86
     153.983     0.999414        87551      1706.67
     169.599     0.999512        87560      2048.00
     182.015     0.999561        87564      2275.56
     194.815     0.999609        87568      2560.00
     204.799     0.999658        87573      2925.71
     214.015     0.999707        87577      3413.33
     225.279     0.999756        87581      4096.00
     229.247     0.999780        87583      4551.11
     239.743     0.999805        87585      5120.00
     250.623     0.999829        87588      5851.43
     255.743     0.999854        87590      6826.67
     258.815     0.999878        87592      8192.00
     264.191     0.999890        87593      9102.22
     266.495     0.999902        87594     10240.00
     268.287     0.999915        87595     11702.86
     283.647     0.999927        87596     13653.33
     287.999     0.999939        87597     16384.00
     292.607     0.999945        87598     18204.44
     292.607     0.999951        87598     20480.00
     299.263     0.999957        87599     23405.71
     299.263     0.999963        87599     27306.67
     301.055     0.999969        87600     32768.00
     301.055     0.999973        87600     36408.89
     301.055     0.999976        87600     40960.00
     305.407     0.999979        87601     46811.43
     305.407     0.999982        87601     54613.33
     305.407     0.999985        87601     65536.00
     305.407     0.999986        87601     72817.78
     305.407     0.999988        87601     81920.00
     329.727     0.999989        87602     93622.86
     329.727     1.000000        87602          inf
#[Mean    =       14.658, StdDeviation   =       12.856]
#[Max     =      329.472, Total count    =        87602]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  95837 requests in 2.00m, 17.00MB read
Requests/sec:    798.64
Transfer/sec:    145.07KB